Autodesk.Revit.DB.ISaveSharedCoordinatesCallback.GetSaveModifiedLinksOption(Autodesk.Revit.DB.RevitLinkType)
Determines whether Revit should save the link, not save the link,
or discard shared positioning entirely.
link:
The Revit link which has modified shared coordinates.
Returns:
The options when saving a linked file which has been modified
in-memory by shared coordinates operations.
Since:
2014

Autodesk.Revit.DB.ISaveSharedCoordinatesCallback
An interface that may be used to control Revit when trying to unload
or reload a Revit link with changes in shared coordinates.
Since:
2014